package crypto;


import static java.util.Map.entry;
import static java.util.Map.ofEntries;

import java.util.Map;


public interface Phrases {
    
    String A = """
    Целостность самого себя — очень таинственное дело. 
    Нам нужна лишь малая часть её для выполнения сложнейших жизненных задач. 
    Но когда мы умираем, мы умираем целостными. 
    Шаман задаётся вопросом: 
    если мы умираем с целостностью самих себя, то почему бы тогда не жить с ней?\
    """.trim();
    
    String B = """
    Обычный человек привык осознавать только то, что считает важным для себя. 
    Но настоящий воин должен осознавать всё и всегда.\
    """.trim();
    
    String C = """
    Для воина главнейшим правилом в жизни является выполнять свои решения столь тщательно, 
    что ничто, случившееся в результате его действий, не может его удивить и уж тем более 
    — истощить его силы.\
    """.trim();
    
    String D = """
    Сила всегда открывает воину кубический сантиметр шанса. 
    Искусство воина состоит в том, чтобы быть непрерывно текучим, 
    иначе он не успеет ухватиться за этот шанс.\
    """.trim();
    
    String E = """
    Когда воин принимает решение, он должен быть готов к смерти. 
    Если он готов умереть, то не будет никаких ловушек, никаких неприятных сюрпризов 
    и никаких ненужных поступков. Всё должно мягко укладываться на своё место, 
    потому что он не ожидает ничего.\
    """.trim();
    
    String F = """
    Смерть — это необходимая добавка к "должен верить". 
    Без осознания смерти всё становится обычным, незначительным. 
    Мир потому и является неизмеримой загадкой, что смерть постоянно выслеживает нас. 
    Без осознания присутствия нашей смерти нет ни силы, ни тайны. 
    Долг верить, что мир таинствен и непостижим, 
    — это выражение самого глубокого предрасположения воина.\
    """.trim();
    
    String G = """
    Воин, как учитель, прежде всего, должен обучить своего ученика одной возможности 
    — способности действовать, не веря, не ожидая наград. 
    Действовать только ради самого действия. 
    Успех дела учителя зависит от того, насколько хорошо 
    и насколько грамотно он ведёт своего ученика именно в этом особом направлении.\
    """.trim();
    
    String H = """
    Воин должен быть текучим и изменяться в гармонии с окружающим миром, 
    будь это мир разума или мир воли. 
    Реальная опасность для воина возникает тогда, когда выясняется, 
    что мир — это ни то и ни другое. 
    Считается, что единственный выход из этой критической ситуации 
    — продолжать действовать так, как если бы ты верил. 
    Секрет воина в том, что он верит, не веря. 
    Разумеется, воин не может просто сказать, что он верит, и на этом успокоиться. 
    Это было бы слишком легко. 
    Простая вера устранила бы его от анализа ситуации. 
    Во всех случаях, когда воин должен связать себя с верой, он делает это по собственному выбору. 
    Воин не верит, воин должен верить.\
    """.trim();
    
    String I = """
    Основное различие между воином и обычным человеком заключается в том, 
    что воин всё принимает как вызов, тогда как обычный человек принимает всё как благословение или проклятие.\
    """.trim();
    
    String J = """
    В помощь стиранию личной истории воин, как учитель, должен обучить своего ученика трём техникам. 
    Они заключаются в избавлении от чувства собственной важности, принятии ответственности за свои поступки 
    и использовании смерти как советчика. 
    Без благоприятного эффекта этих техник стирание личной истории может вызвать в ученике неустойчивость, 
    ненужную и вредную двойственность относительно самого себя и своих поступков.\
    """.trim();
    
    String K = """
    Только воин может выстоять на пути знания. 
    Воин не жалуется и ни о чём не сожалеет. 
    Его жизнь — бесконечный вызов, а вызовы не могут быть плохими или хорошими. 
    Вызовы — это просто вызовы.\
    """.trim();
    
    String L = """
    Секрет светящихся существ заключается в том, что у них есть кое-что такое, 
    что почти никогда не используется, — воля. 
    Уловка шаманов — это та же уловка обычного человека. 
    У обоих есть описание мира. 
    Обычный человек поддерживает своё при помощи разума, а шаман — при помощи воли. 
    Оба описания имеют свои законы, и эти законы поддаются восприятию. 
    Но описание шамана гласит, что воля более всеобъемлюща, чем разум. 
    Воин позволяет себе воспринимать и поддерживать оба описания — мира разума и мира воли. 
    Это единственный способ использовать повседневный мир как вызов 
    и как средство накопить достаточно личной силы для обретения целостности самого себя.\
    """.trim();
    
    String M = """
    Нет никакого способа избавиться от жалости к самому себе, освободиться от неё с пользой. 
    Она занимает определённое место и имеет определённый характер в жизни обычного человека
    — определённый фасад, который видно издалека. 
    Поэтому каждый раз, когда предоставляется случай, жалость к самому себе становится активной. 
    Такова её история. 
    Если человек меняет фасад жалости к самому себе, то он убирает и её выдающееся положение. 
    Фасады изменяют, изменяя использование элементов самого фасада. 
    Жалость к себе полезна для того, кто ею пользуется, 
    потому что он чувствует свою важность и считает, 
    что заслуживает лучших условий, лучшего обращения. 
    Она ещё и потому имеет значение, что человек не хочет принимать ответственность за поступки, 
    которые побуждают его жалеть самого себя.\
    """.trim();
    
    String N = """
    Люди — воспринимающие существа. 
    Однако воспринимаемый ими мир является иллюзией
    — иллюзией, созданной описанием, которое им внушали с момента, когда они появились на свет. 
    Мы, светящиеся существа, рождаемся с двумя кольцами силы, 
    но для создания мира используем только одно из них. 
    Это кольцо, которое замыкается на нас в первые годы жизни, есть разум и его компаньон, речь. 
    Именно они, столковавшись между собой, и состряпали этот мир при помощи описания
    и его догматических и незыблемых правил, а теперь поддерживают его.\
    """.trim();
    
    String O = """
    Изменение фасадов жалости к себе означает только то, 
    что воин переносит прежде важные составляющие на второй план. 
    Жалость к самому себе по-прежнему остаётся чертой его характера, 
    однако теперь она занимает место на заднем плане 
    — подобно тому, как представления о надвигающейся смерти, 
    о смирении воина или об ответственности за свои поступки 
    когда-то тоже существовали на заднем плане и никак не использовались до тех пор, 
    пока воин не стал воином.\
    """.trim();
    
    String P = """
    Наш разум заставляет нас забыть, что описание — это только описание, и, прежде чем осознать это, 
    человеческие существа сами заключают себя в заколдованный круг, 
    из которого они редко вырываются в течение отпущенного им времени жизни.\
    """.trim();
    
    String Q = """
    Воин признаёт свою боль, но не индульгирует в ней. 
    Поэтому настроение воина, который входит в неизвестность, — это не печаль. 
    Напротив, он весел, потому что он чувствует смирение перед своей удачей, 
    уверенность в том, что его дух неуязвим, 
    и, превыше всего, полное осознание своей эффективности. 
    Радость воина исходит из его признания своей судьбы и его правдивой оценки того, 
    что лежит перед ним.\
    """.trim();
    
    String R = """
    Человеческие существа — это не объекты. 
    Они — круглые, светящиеся существа, не объекты, 
    а чистое осознание, не имеющее ни плотности, ни границ. 
    Представление о плотном мире лишь облегчает наше путешествие на земле, 
    это описание, созданное нами для удобства, но не более.\
    """.trim();
    
    String S = """
    Человек становится мужественным, когда ему нечего терять. 
    Мы малодушны только тогда, когда есть ещё что-то, за что мы можем цепляться.\
    """.trim();
    
    String T = """
    Воин умирает трудным способом. 
    Его смерть должна бороться с ним. 
    Воин не отдаётся смерти так просто.\
    """.trim();
    
    String U = """
    У воина нет возможности отдавать что бы то ни было на волю случая. 
    Воин реально влияет на результаты событий силой своего осознания и своего несгибаемого намерения.\
    """.trim();
    
    String V = """
    Быть воином — это не значит просто желать им быть. 
    Это, скорее, бесконечная битва, которая будет длиться до последнего момента. 
    Никто не рождается воином, точно так же, как никто не рождается обычным человеком. 
    Мы сами себя делаем тем или другим.\
    """.trim();
    
    String W = """
    Если воин хочет отдать долг за всё то добро, которое для него сделали, 
    и у него нет возможности сделать это по отношению к конкретному человеку, 
    который когда-то помог ему, он может сделать свой вклад в человеческий дух. 
    Это может быть очень немного, но, сколько бы он ни вложил, 
    этого всегда будет более чем достаточно.\
    """.trim();
    
    String X = """
    Обычный человек считает, что индульгировать в сомнениях и колебаниях 
    — это признак чувствительности и духовности. 
    Правда состоит в том, что обычный человек очень далёк от того, чтобы быть чувствительным. 
    Он обманывает себя не намеренно, но его маленький разум превращает себя в чудовище или святого, 
    но на самом деле он слишком мал для такой большой формы, 
    какую заполняет чудовище или святой.\
    """.trim();
    
    String Y = """
    После описания мира в очень прекрасной и просвещённой манере 
    учёный в пять часов уходит домой отдыхать от своих замечательных построений.\
    """.trim();
    
    String Z = """
    Воин должен культивировать чувство, 
    что у него есть всё необходимое для этого экстравагантного путешествия, 
    которым является его жизнь. 
    В случае воина всё, что для этого нужно, — это быть живым. 
    Жизнь — это маленькая прогулка, которую мы предпринимаем сейчас, 
    жизнь сама по себе достаточна, сама себя объясняет и заполняет. 
    Понимая это, воин живёт соответственно. 
    Поэтому можно смело сказать, что опыт всех опытов — это быть живым.\
    """.trim();
    
    String AA = """
    Человеческая форма представляет собой существующий во Вселенной 
    и связанный исключительно с человеческими существами конгломерат энергетических полей. 
    Шаманы назвали его человеческой формой, 
    потому что за время жизни человека эти энергетические поля искажаются 
    и контролируются привычками и неверным использованием.\
    """.trim();
    
    String BB = """
    Воины выигрывают свои битвы не потому, что они бьются головами о стены, 
    а потому, что берут их. 
    Воины прыгают через стены; они не разрушают их.\
    """.trim();
    
    String CC = """
    Воин знает, что измениться он не может. 
    Но хотя ему это прекрасно известно, он всё же пытается изменить себя. 
    Это единственное преимущество, которое воин имеет перед обыкновенным человеком. 
    Воин не испытывает разочарования, когда, пытаясь измениться, терпит неудачу.\
    """.trim();
    
    String DD = """
    Мир неизмерим. 
    Как и мы, как и каждое существо, которое есть в этом мире.\
    """.trim();
    
    String EE = """
    Чтобы вспугнуть человеческую форму и стряхнуть её, 
    воины должны быть безупречны в своём стремлении измениться. 
    После долгих лет безупречности наступит такой момент, 
    когда человеческая форма уже не может выдержать её и уходит. 
    Это означает, что придёт такой миг, когда энергетические поля, 
    искажавшиеся в течение жизни под влиянием привычек, распрямляются. 
    Несомненно, при таком распрямлении энергетических полей воин испытывает сильное потрясение 
    и даже может погибнуть, однако безупречный воин непременно выживет.\
    """.trim();
    
    String FF = """
    Всегда, когда прекращается внутренний диалог, мир разрушается, 
    и на поверхность выходят незнакомые грани нас самих, 
    как если бы до этого они содержались под усиленной охраной наших слов.\
    """.trim();
    
    String GG = """
    Единственная свобода для воина состоит в том, что он должен быть безупречным. 
    Безупречность является не только свободой, 
    но и единственным способом вспугнуть человеческую форму.\
    """.trim();
    
    String HH = """
    Знание приходит, летя, как крупицы золотой пыли, той самой пыльцы, 
    которая покрывает крылья бабочек. 
    Так что для воина знание похоже на ливень, 
    на пребывание под дождём из крупиц тёмно-золотой пыли.\
    """.trim();
    
    String II = """
    Любой привычке для функционирования необходимы все её составные части. 
    Если некоторые части отсутствуют, привычка разрушается. 
    Привычка нуждается во всех своих составных частях, чтобы оставаться живой.\
    """.trim();
    
    String JJ = """
    Знание — это наиболее пугающая вещь, особенно для воина. 
    Но если воин однажды принимает пугающую природу знания, 
    то он отбрасывает саму возможность ужасаться. 
    Знание для воина является чем-то таким, что приходит сразу, поглощает его и проходит.\
    """.trim();
    
    String KK = """
    Битва происходит именно здесь, на этой земле. 
    Мы — человеческие существа. 
    Кто знает, что ожидает нас и какого рода силу мы можем иметь?\
    """.trim();
    
    String LL = """
    Воин рассматривает себя как бы уже мёртвым, поэтому ему нечего терять. 
    Самое худшее с ним уже случилось, поэтому он ясен и спокоен. 
    Если судить о нём по его поступкам, то никогда нельзя заподозрить, что он замечает всё.\
    """.trim();
    
    String MM = """
    Мир людей поднимается и опускается, и люди поднимаются и опускаются вместе со своим миром. 
    Воинам незачем следовать за подъёмами и спусками их ближних.\
    """.trim();
    
    String NN = """
    Слабая сторона слов в том, что они заставляют нас чувствовать себя осведомлёнными, 
    но когда мы оборачиваемся, чтобы взглянуть на мир, они всегда предают нас, 
    и мы опять смотрим на мир как обычно, без всякого просветления. 
    Поэтому воин предпочитает действовать, а не говорить. 
    В результате он получает новое описание мира, в котором разговоры не столь важны, 
    а новые поступки имеют новые отражения.\
    """.trim();
    
    String OO = """
    Ядром нашего существа является акт восприятия, 
    а магической тайной нашего бытия — акт осознания. 
    Восприятие и осознание является обособленной нерасчленимой функциональной единицей.\
    """.trim();
    
    String PP = """
    Окружающие нас люди являются чёрными магами. 
    И тот, кто с ними, тот тоже чёрный маг. 
    Задумайтесь на секунду. 
    Можете ли вы уклониться от тропы, которую для вас проложили ваши близкие? 
    Нет. 
    Ваши мысли и поступки навсегда зафиксированы в их терминологии. 
    Это рабство. 
    Воин, с другой стороны, свободен от всего этого. 
    Свобода стоит дорого, но цена не невозможна. 
    Поэтому бойтесь своих тюремщиков, своих учителей. 
    Истратьте времени и сил, боясь свободы.\
    """.trim();
    
    String QQ = """
    Мы делаем выбор только один раз. 
    Мы выбираем быть воином или быть обычным человеком. 
    Другого выбора просто не существует. 
    Не на этой земле.\
    """.trim();
    
    String RR = """
    Утешение, небеса, страх — всё это слова, которые создают настроения, 
    которым человек учится, даже не спрашивая об их ценности. 
    Так чёрные маги завладевают его преданностью.\
    """.trim();
    
    String SS = """
    Путь воина приводит человека в новую жизнь, и эта новая жизнь должна быть полностью новой. 
    Он не может вносить в эту новую жизнь свои уродливые старые пути.\
    """.trim();
    
    String TT = """
    Смирение воина и смирение нищего — невероятно разные вещи. 
    Воин ни перед кем не опускает голову, 
    но в то же время он никому не позволяет опускать голову перед ним. 
    Нищий, напротив, падает на колени и шляпой метёт пол перед тем, кого считает выше себя. 
    Но тут же требует, чтобы те, кто ниже его, мели пол перед ним.\
    """.trim();
    
    String UU = """
    Особое значение воины всегда придают первому событию из любой серии событий, так как оно является подлинным знаком. 
    Воины рассматривают такое событие как программу или карту того, что должно произойти впоследствии.\
    """.trim();
    
    String VV = """
    Воин берёт свою судьбу, какой бы она ни была, и принимает её в абсолютном смирении. 
    Он в смирении принимает себя таким, каков он есть, но не как повод для сожаления, 
    а как живой вызов.\
    """.trim();
    
    String WW = """
    Человеческим существам нравится, когда им говорят, что следует делать, 
    однако ещё больше им нравится сопротивляться и не делать того, о чём им говорили. 
    Именно поэтому они прежде всего запутываются в ненависти к тому, 
    кто им советует что-то делать.\
    """.trim();
    
    String XX = """
    Главная помеха для воина — внутренний диалог: это ключ ко всему. 
    Когда воин научится останавливать его, всё становится возможным. 
    Самые невероятные проекты становятся выполнимыми.\
    """.trim();
    
    String YY = """
    Каждый имеет достаточно личной силы для чего угодно. 
    В случае воина фокус состоит в том, чтобы отвернуть свою личную силу от своих слабостей 
    и направить её к своей цели воина.\
    """.trim();
    
    String ZZ = """
    Ключом к шаманизму является изменение нашей идеи мира. 
    Остановка внутреннего диалога — единственный путь к этому. 
    Всё остальное — просто разговоры. 
    Всё, что бы вы ни сделали, за исключением остановки внутреннего диалога, 
    ничего не сможет изменить ни в вас самих, ни в вашей идее мира.\
    """.trim();
    
    String ZERO = """
    Все могут видеть, хотя мы выбираем не помнить, что мы видим.\
    """.trim();
    
    String ONE = """
    Именно внутренний диалог прижимает к земле людей в повседневной жизни. 
    Мир для нас такой-то и такой-то или этакий и этакий лишь потому, 
    что мы сами себе говорим о нём, что он такой-то и такой-то или этакий и этакий. 
    Вход в мир шаманов открывается лишь после того, 
    как воин научится останавливать свой внутренний диалог.\
    """.trim();
    
    String TWO = """
    Искусство сновидения — это способность владеть своим обычным сном, 
    переводя его в контролируемое состояние сознания при помощи особой формы внимания, 
    которое называется вниманием сновидения, или вторым вниманием.\
    """.trim();
    
    String THREE = """
    Если воин в чём-то добивается успеха, то этот успех должен приходить мягко, 
    пусть даже с огромными усилиями, но без потрясений и навязчивых идей.\
    """.trim();
    
    String FOUR = """
    Искусство сталкинга — это совокупность приёмов и установок, 
    позволяющих находить наилучший выход из любой мыслимой ситуации.\
    """.trim();
    
    String FIVE = """
    Единственно возможный для воина курс — это действовать неуклонно, 
    не оставляя места для отступления. 
    Он достаточно знает о пути воина, чтобы поступать должным образом, 
    но его старые привычки и повседневная рутина жизни могут препятствовать ему на его пути.\
    """.trim();
    
    String SIX = """
    Воинам рекомендуется не иметь никаких материальных вещей, 
    на которых концентрировалась бы их сила, 
    фокусироваться на духе, на действительном полёте в неведомое, 
    а не на тривиальных вещах. 
    Каждый, кто хочет следовать пути воина, 
    должен освободиться от страсти владеть и цепляться за вещи.\
    """.trim();
    
    String SEVEN = """
    Есть множество вещей, которые воин может делать в определённое время, из тех, 
    которые несколько лет назад показались бы ему безумием. 
    Сами по себе эти вещи не изменились, изменилось его представление о себе. 
    Невозможное тогда стало вполне возможным сейчас.\
    """.trim();
    
    String EIGHT = """
    Видение является знанием на уровне тела. 
    Ведущая роль зрения воздействует на знание тела и создаёт иллюзию, 
    что оно связано с глазами.\
    """.trim();
    
    String NINE = """
    Уверенность в себе воина и самоуверенность обычного человека — это разные вещи. 
    Обычный человек ищет признания в глазах окружающих, называя это уверенностью в себе. 
    Воин ищет безупречности в собственных глазах и называет это смирением. 
    Обычный человек цепляется за окружающих, а воин рассчитывает только на себя. 
    Разница между этими понятиями огромна. 
    Самоуверенность означает, что ты знаешь что-то наверняка; 
    смирение воина — это безупречность в поступках и чувствах. 
    Обычный человек цепляется за подобного себе человека, воин цепляется за бесконечность.\
    """.trim();
    
    String PLUS = """
    Потеря человеческой формы подобна спирали. 
    Она даёт воину свободу помнить себя как конгломерат полей энергии, 
    а это, в свою очередь, делает его ещё более свободным.\
    """.trim();
    
    String SLASH = """
    Искусство воина состоит в сохранении равновесия между ужасом быть человеком и чудом быть человеком.\
    """.trim();
    
    String EQUALS = """
    Воин знает, что он ждёт, и он знает, чего он ждёт, и, пока он ждёт, он насыщает свои глаза миром. 
    Для воина окончательное выполнение его задачи является наслаждением, радостью бесконечности.\
    """.trim();


    Map<Character, String> CHAR_TO_STRING_MAPPER = ofEntries(
        entry('A', A),
        entry('B', B),
        entry('C', C),
        entry('D', D),
        entry('E', E),
        entry('F', F),
        entry('G', G),
        entry('H', H),
        entry('I', I),
        entry('J', J),
        entry('K', K),
        entry('L', L),
        entry('M', M),
        entry('N', N),
        entry('O', O),
        entry('P', P),
        entry('Q', Q),
        entry('R', R),
        entry('S', S),
        entry('T', T),
        entry('U', U),
        entry('V', V),
        entry('W', W),
        entry('X', X),
        entry('Y', Y),
        entry('Z', Z),
        entry('a', AA),
        entry('b', BB),
        entry('c', CC),
        entry('d', DD),
        entry('e', EE),
        entry('f', FF),
        entry('g', GG),
        entry('h', HH),
        entry('i', II),
        entry('j', JJ),
        entry('k', KK),
        entry('l', LL), 
        entry('m', MM),
        entry('n', NN),
        entry('o', OO),
        entry('p', PP),
        entry('q', QQ),
        entry('r', RR),
        entry('s', SS),
        entry('t', TT), 
        entry('u', UU),
        entry('v', VV),
        entry('w', WW),
        entry('x', XX),
        entry('y', YY),
        entry('z', ZZ),
        entry('0', ZERO),
        entry('1', ONE),
        entry('2', TWO),
        entry('3', THREE),
        entry('4', FOUR),
        entry('5', FIVE),
        entry('6', SIX),
        entry('7', SEVEN),
        entry('8', EIGHT),
        entry('9', NINE),
        entry('+', PLUS),
        entry('/', SLASH),
        entry('=', EQUALS)
    );

    Map<String, Character> STRING_TO_CHAR_MAPPER = ofEntries(
        entry(A, 'A'),
        entry(B, 'B'),
        entry(C, 'C'), 
        entry(D, 'D'), 
        entry(E, 'E'), 
        entry(F, 'F'), 
        entry(G, 'G'), 
        entry(H, 'H'), 
        entry(I, 'I'), 
        entry(J, 'J'), 
        entry(K, 'K'), 
        entry(L, 'L'), 
        entry(M, 'M'),
        entry(N, 'N'), 
        entry(O, 'O'), 
        entry(P, 'P'), 
        entry(Q, 'Q'), 
        entry(R, 'R'), 
        entry(S, 'S'), 
        entry(T, 'T'), 
        entry(U, 'U'), 
        entry(V, 'V'), 
        entry(W, 'W'), 
        entry(X, 'X'), 
        entry(Y, 'Y'), 
        entry(Z, 'Z'),
        entry(AA, 'a'), 
        entry(BB, 'b'), 
        entry(CC, 'c'), 
        entry(DD, 'd'), 
        entry(EE, 'e'), 
        entry(FF, 'f'), 
        entry(GG, 'g'), 
        entry(HH, 'h'), 
        entry(II, 'i'), 
        entry(JJ, 'j'), 
        entry(KK, 'k'), 
        entry(LL, 'l'), 
        entry(MM, 'm'),
        entry(NN, 'n'), 
        entry(OO, 'o'), 
        entry(PP, 'p'), 
        entry(QQ, 'q'), 
        entry(RR, 'r'), 
        entry(SS, 's'), 
        entry(TT, 't'), 
        entry(UU, 'u'), 
        entry(VV, 'v'), 
        entry(WW, 'w'), 
        entry(XX, 'x'), 
        entry(YY, 'y'), 
        entry(ZZ, 'z'),
        entry(ZERO, '0'), 
        entry(ONE, '1'), 
        entry(TWO, '2'), 
        entry(THREE, '3'), 
        entry(FOUR, '4'), 
        entry(FIVE, '5'), 
        entry(SIX, '6'), 
        entry(SEVEN, '7'), 
        entry(EIGHT, '8'), 
        entry(NINE, '9'), 
        entry(PLUS, '+'), 
        entry(SLASH, '/'),
        entry(EQUALS, '=')
    );
}